{
    "en": {
        "tech": [
            "C++",
            "SFML / Qt",
            "Graph Theory Algorithms"
        ],
        "features": [
            "Interactive graph construction and editing",
            "Support for directed, weighted, and undirected graphs",
            "Pathfinding visualizer (Dijkstra, A*)",
            "Minimum Spanning Tree (Prim/Kruskal) generation",
            "Persistence system for graph models"
        ],
        "stack": {
            "language": "C++",
            "framework": "Native Desktop GUI",
            "tools": [
                "GCC",
                "CMake",
                "SFML"
            ],
            "database": "Custom Serialization (.json)"
        },
        "screenshots": [],
        "description": "A sophisticated C++ workstation for exploring the intricacies of Graph Theory. The application provides an interactive canvas where users can build complex networks, assign weights, and define directions. It serves as an educational and technical laboratory, visualizing real-time executions of legendary algorithms such as Dijkstra, A*, Prim, and Kruskal. With seamless graph persistence and an optimized SFML-based rendering engine, it is the perfect tool for both university students and algorithm researchers."
    },
    "es": {
        "tech": [
            "C++",
            "SFML / Qt",
            "Algoritmos de Teoría de Grafos"
        ],
        "features": [
            "Construcción y edición interactiva de grafos",
            "Soporte para grafos dirigidos, pesados y no dirigidos",
            "Visualizador de rutas (Dijkstra, A*)",
            "Generación de Árbol de Expansión Mínima (Prim/Kruskal)",
            "Sistema de persistencia para modelos de grafos"
        ],
        "stack": {
            "language": "C++",
            "framework": "Interfaz Gráfica Nativa",
            "tools": [
                "GCC",
                "CMake",
                "SFML"
            ],
            "database": "Serialización Personalizada (.json)"
        },
        "screenshots": [],
        "description": "Una sofisticada estación de trabajo en C++ para explorar las complejidades de la Teoría de Grafos. La aplicación proporciona un lienzo interactivo donde los usuarios pueden construir redes complejas, asignar pesos y definir direcciones. Sirve como un laboratorio educativo y técnico, visualizando ejecuciones en tiempo real de algoritmos legendarios como Dijkstra, A*, Prim y Kruskal. Con persistencia fluida de grafos y un motor de renderizado optimizado basado en SFML, es la herramienta perfecta para investigadores de algoritmos."
    }
}